{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ICD10-A",
    "1": "ICD10-B",
    "2": "ICD10-C",
    "3": "ICD10-D",
    "4": "ICD10-E",
    "5": "ICD10-F",
    "6": "ICD10-G",
    "7": "ICD10-H",
    "8": "ICD10-I",
    "9": "ICD10-J",
    "10": "ICD10-K",
    "11": "ICD10-L",
    "12": "ICD10-M",
    "13": "ICD10-N",
    "14": "ICD10-O",
    "15": "ICD10-Q",
    "16": "ICD10-R",
    "17": "ICD10-S",
    "18": "ICD10-T",
    "19": "ICD10-Z",
    "20": "ICD9-Blood",
    "21": "ICD9-Circulatory",
    "22": "ICD9-Congenital",
    "23": "ICD9-Digestive",
    "24": "ICD9-Endocrine",
    "25": "ICD9-Genitourinary",
    "26": "ICD9-Infectious",
    "27": "ICD9-Injury",
    "28": "ICD9-Mental",
    "29": "ICD9-Musculoskeletal",
    "30": "ICD9-Neoplasms",
    "31": "ICD9-Nervous",
    "32": "ICD9-Pregnancy",
    "33": "ICD9-Respiratory",
    "34": "ICD9-Skin",
    "35": "ICD9-Supplementary-V",
    "36": "ICD9-Symptoms"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "ICD10-A": 0,
    "ICD10-B": 1,
    "ICD10-C": 2,
    "ICD10-D": 3,
    "ICD10-E": 4,
    "ICD10-F": 5,
    "ICD10-G": 6,
    "ICD10-H": 7,
    "ICD10-I": 8,
    "ICD10-J": 9,
    "ICD10-K": 10,
    "ICD10-L": 11,
    "ICD10-M": 12,
    "ICD10-N": 13,
    "ICD10-O": 14,
    "ICD10-Q": 15,
    "ICD10-R": 16,
    "ICD10-S": 17,
    "ICD10-T": 18,
    "ICD10-Z": 19,
    "ICD9-Blood": 20,
    "ICD9-Circulatory": 21,
    "ICD9-Congenital": 22,
    "ICD9-Digestive": 23,
    "ICD9-Endocrine": 24,
    "ICD9-Genitourinary": 25,
    "ICD9-Infectious": 26,
    "ICD9-Injury": 27,
    "ICD9-Mental": 28,
    "ICD9-Musculoskeletal": 29,
    "ICD9-Neoplasms": 30,
    "ICD9-Nervous": 31,
    "ICD9-Pregnancy": 32,
    "ICD9-Respiratory": 33,
    "ICD9-Skin": 34,
    "ICD9-Supplementary-V": 35,
    "ICD9-Symptoms": 36
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
